import 'package:json_annotation/json_annotation.dart';
@JsonSerializable()
class Person {
  String surname;
  String name;
  String middlename;
  Person(this.surname,this.name,this.middlename);
  factory Person.fromJson(Map<String, dynamic> json) {
    return Person(
      json['Фамилия'] ?? '',
      json['Имя'] ?? "",
      json['Отчество'] ?? ""
    );
  }
}

/*
[{"Фамилия":"Самый","Имя":"Главный","Отчество":"Начальник"},
{"Фамилия":"Самый","Имя":"Обычный","Отчество":"Сотрудник"},
{"Фамилия":"Самый","Имя":"Мелкий","Отчество":"Подчиненный"},
{"Фамилия":"1231Иванов","Имя":"Bfsa","Отчество":"Sfdsf"},
{"Фамилия":"Иванов","Имя":"2","Отчество":"Ivanich"},
{"Фамилия":"Иванов","Имя":"Иван","Отчество":"Иванович"},
{"Фамилия":"Иванов","Имя":"Сергей","Отчество":null},
{"Фамилия":"Иванов","Имя":"Петр","Отчество":null},
{"Фамилия":"Иванов","Имя":"Владимир","Отчество":null},
{"Фамилия":"Иванов","Имя":"Петр","Отчество":null}]

 */